Examinator/src/InformationRegisters/ПопыткиПрохожденияЗаданийСУО/ПопыткиПрохожденияЗаданийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЗаданийСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаПроверку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>CatalogRef.ВариантыЗаданийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозвратаНаДоработку</name>
    <type>
      <types>CatalogRef.ПричиныВозвратаЗаданияНаДоработкуСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаНаДоработку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЖдатьПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьВремяДоступаКЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПрохожденияОбученияСУО/ПрохожденияОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияОбученияСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноОбщениеМеждуУчастниками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроцессаОбученияСУО/СтатусыПроцессаОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессаОбученияСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Окончено</name>
  </enumValues>
  <enumValues>
    <name>ОконченоБезПроверки</name>
  </enumValues>
  <enumValues>
    <name>ОконченоАвтоматом</name>
  </enumValues>
  <enumValues>
    <name>НеОкончено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/HTTPServices/РезультатыОбученияСУО/Module.bsl
Функция ПолучитьРезультатыОбучения(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем параметры запроса
	
	КлючЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("key")));
	
	Если НЕ ЗначениеЗаполнено(КлючЗапроса) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;								
	КонецЕсли;		
	
	ДатаПредыдущегоЗапроса = ЗапросHTTP.ПараметрыЗапроса.Получить("previousRequestDate");
	
	Попытка
		ДатаПредыдущегоЗапроса = XMLЗначение(Тип("Дата"), ДатаПредыдущегоЗапроса);
	Исключение
		ДатаПредыдущегоЗапроса = Дата("00010101");
	КонецПопытки;
	
	// Проверяем ключ
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(КлючЗапроса);		
	ХэшКлюча = Base64Строка(Хеширование.ХешСумма);
	ХэшКлючаВБазе = Константы.ХэшКлючаВыгрузкиРезультатовОбученияСУО.Получить();
	
	Если ХэшКлючаВБазе <> ХэшКлюча Тогда
		Ответ = Новый HTTPСервисОтвет(403);
		Возврат Ответ;												
	КонецЕсли;
	
	// Возвращаем ответ, если это запрос для тестирования
	
	ВариантЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("mode")));
	Если ВариантЗапроса = "test" Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Возврат Ответ;		
	КонецЕсли;
	
	// Получаем задания, с активностью после указанной даты	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткиПрохожденияЗаданийСУО.ПрохождениеОбучения,
		|	ПопыткиПрохожденияЗаданийСУО.Задание,
		|	ПопыткиПрохожденияЗаданийСУО.Баллы,
		|	ПопыткиПрохожденияЗаданийСУО.ДатаПоследнейАктивности,
		|	ПопыткиПрохожденияЗаданийСУО.Период,
		|	ПопыткиПрохожденияЗаданийСУО.ПроведениеОбучения
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЗаданийСУО КАК ПопыткиПрохожденияЗаданийСУО
		|ГДЕ
		|	&ОтборПоДатеАктивности
		|	И ПопыткиПрохожденияЗаданийСУО.Выполнено = ИСТИНА";
	
	Если ЗначениеЗаполнено(ДатаПредыдущегоЗапроса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеАктивности", "ПопыткиПрохожденияЗаданийСУО.ДатаПоследнейАктивности > &ПоследняяДатаВыгрузки");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеАктивности", "ПопыткиПрохожденияЗаданийСУО.ДатаПоследнейАктивности >= &ПоследняяДатаВыгрузки");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПоследняяДатаВыгрузки", ДатаПредыдущегоЗапроса);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПрохожденийЗаданий = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Получаем прохождения обучения, с активностью после указанной даты	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохожденияОбученияСУО.ПроведениеОбучения,
		|	ПрохожденияОбученияСУО.Пользователь,
		|	ПрохожденияОбученияСУО.Сценарий,
		|	ПрохожденияОбученияСУО.Баллы,
		|	ПрохожденияОбученияСУО.ПроведениеОбучения.Дисциплина КАК Дисциплина,
		|	ПрохожденияОбученияСУО.ДатаПоследнейАктивности,
		|	ПрохожденияОбученияСУО.Сценарий.Наименование КАК НаименованиеОбучения,
		|	ПрохожденияОбученияСУО.Регистратор КАК ПрохождениеОбучения,
		|	ПрохожденияОбученияСУО.ДатаНачалаПрохождения,
		|	ПрохожденияОбученияСУО.СтатусПроцессаОбучения,
		|	ПрохожденияОбученияСУО.Пользователь.Наименование КАК ПолноеИмяПользователя,
		|	ПрохожденияОбученияСУО.Пользователь.Код КАК КодПользователя,
		|	ПрохожденияОбученияСУО.ПроведениеОбучения.ГруппаСлушателей КАК ГруппаСлушателей,
		|	ПрохожденияОбученияСУО.ПроведениеОбучения.ПрограммаОбучения КАК ПрограммаОбучения
		|ИЗ
		|	РегистрСведений.ПрохожденияОбученияСУО КАК ПрохожденияОбученияСУО
		|ГДЕ
		|	&ОтборПоДатеАктивности
		|	И ПрохожденияОбученияСУО.СтатусПроцессаОбучения <> &СтатусПроцессаОбученияНовое
		|	И ПрохожденияОбученияСУО.СтатусПроцессаОбучения <> &СтатусПроцессаОбученияНеДопущен
		|	И ПрохожденияОбученияСУО.СтатусПроцессаОбучения <> &СтатусПроцессаОбученияЗапланировано";
			
	Если ЗначениеЗаполнено(ДатаПредыдущегоЗапроса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеАктивности", "ПрохожденияОбученияСУО.ДатаПоследнейАктивности > &ПоследняяДатаВыгрузки");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоДатеАктивности", "ПрохожденияОбученияСУО.ДатаПоследнейАктивности >= &ПоследняяДатаВыгрузки");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ПоследняяДатаВыгрузки", ДатаПредыдущегоЗапроса);
	Запрос.УстановитьПараметр("СтатусПроцессаОбученияНовое", Перечисления.СтатусыПроцессаОбученияСУО.Новое);
	Запрос.УстановитьПараметр("СтатусПроцессаОбученияНеДопущен", Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен);
	Запрос.УстановитьПараметр("СтатусПроцессаОбученияЗапланировано", Перечисления.СтатусыПроцессаОбученияСУО.Запланировано);
	
	УстановитьПривилегированныйРежим(Истина);	
	ТаблицаПрохожденийОбучения = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Получаем задания всех проведений обучения
	
	ВсеПроведенияОбучения = ТаблицаПрохожденийОбучения.ВыгрузитьКолонку("ПроведениеОбучения");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеПроведенияОбучения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Задание,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Задание.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.ЭлектронныеЗадания КАК ПроведениеОбученияСУОЭлектронныеЗадания
		|ГДЕ
		|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка В(&ВсеПроведенияОбучения)";
	
	Запрос.УстановитьПараметр("ВсеПроведенияОбучения", ВсеПроведенияОбучения);
	
	УстановитьПривилегированныйРежим(Истина);	
	ТаблицаЗаданий = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);	

	// Формируем итоговую таблицу
	
	ТаблицаПрохожденийОбучения.Колонки.Добавить("ОценкаПятибалльная");
	ТаблицаПрохожденийОбучения.Колонки.Добавить("Задания");
	ТаблицаПрохожденийОбучения.Колонки.Добавить("УдалитьИзВыдачи");
	Для каждого СтрокаПрохождения Из ТаблицаПрохожденийОбучения Цикл
		
		// Заполняем оценку в пятибалльной шкале
		
		СтрокаПрохождения.ОценкаПятибалльная = Справочники.ШкалыОценокСУО.БаллыВПятибалльнуюОценкуЧислом(СтрокаПрохождения.Баллы);		
		
		// Заполням таблицу заданий
		
		ЗаданияТекущегоПроведения = ТаблицаЗаданий.НайтиСтроки(Новый Структура("ПроведениеОбучения", СтрокаПрохождения.ПроведениеОбучения));
		
		Если ЗаданияТекущегоПроведения.Количество() > 0 Тогда
			СтрокаПрохождения.Задания = Новый Массив;						
			Для каждого СтрокаЗадания Из ЗаданияТекущегоПроведения Цикл
				
				СтрокиПрохожденияЗаданий = ТаблицаПрохожденийЗаданий.НайтиСтроки(Новый Структура("Задание, ПрохождениеОбучения", СтрокаЗадания.Задание, СтрокаПрохождения.ПрохождениеОбучения));
				Если СтрокиПрохожденияЗаданий.Количество() = 0 Тогда
					Продолжить;					
				КонецЕсли;
				
				СтрокаПрохожденияЗадания = СтрокиПрохожденияЗаданий[0];
				
				Если ТипЗнч(СтрокаПрохожденияЗадания.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
					ТестЭР = Справочники.СводыЗнанийСУЗ.Тест(СтрокаПрохожденияЗадания.Задание);
					Если ЗначениеЗаполнено(ТестЭР) Тогда
						НазначениеТеста = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТестЭР, "НазначениеТестирования");
						Если НазначениеТеста = Перечисления.НазначенияТестированийСУЗ.Анкетирование Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;				
				
				СтруктураПрохожденияЗадания = Новый Структура("Задание, Баллы, ДатаПоследнейАктивности, ОценкаПятибалльная, Наименование, ДатаНачалаПрохождения");
				СтруктураПрохожденияЗадания.Задание = СтрокаПрохожденияЗадания.Задание;
				СтруктураПрохожденияЗадания.Баллы = СтрокаПрохожденияЗадания.Баллы;
				СтруктураПрохожденияЗадания.ДатаПоследнейАктивности = СтрокаПрохожденияЗадания.ДатаПоследнейАктивности;
				СтруктураПрохожденияЗадания.ОценкаПятибалльная = Справочники.ШкалыОценокСУО.БаллыВПятибалльнуюОценкуЧислом(СтруктураПрохожденияЗадания.Баллы);
				СтруктураПрохожденияЗадания.Наименование = СтрокаЗадания.Наименование;
				СтруктураПрохожденияЗадания.ДатаНачалаПрохождения = СтрокаПрохожденияЗадания.Период;
				СтрокаПрохождения.Задания.Добавить(СтруктураПрохожденияЗадания);
				
			КонецЦикла;
			Если СтрокаПрохождения.Задания.Количество() = 0 Тогда
				СтрокаПрохождения.УдалитьИзВыдачи = Истина;
			КонецЕсли;
		Иначе
			Если СтрокаПрохождения.СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено
				И СтрокаПрохождения.СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда
				СтрокаПрохождения.УдалитьИзВыдачи = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаПрохождения.ДатаНачалаПрохождения) Тогда
			СтрокаПрохождения.УдалитьИзВыдачи = Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	// Удаляем лишние строки итоговой таблицы
	
	Сч = ТаблицаПрохожденийОбучения.Количество();

	Пока Сч > 0 Цикл
		
		Строка = ТаблицаПрохожденийОбучения.Получить(Сч - 1);

		Если Строка.УдалитьИзВыдачи = Истина Тогда		
			ТаблицаПрохожденийОбучения.Удалить(Строка);			
		КонецЕсли;		
		
		Сч = Сч - 1;
		
	КонецЦикла;
	
	ТаблицаПрохожденийОбучения.Колонки.Удалить("УдалитьИзВыдачи");
	
	// Возвращаем результат
	
	ТаблицаJSON = ОбщегоНазначенияСУ.ДанныеВJSON(ТаблицаПрохожденийОбучения);	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТаблицаJSON);
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьУведомленияGET(ЗапросHTTP)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем параметры запроса
	
	КлючЗапроса = СокрЛП(Строка(ЗапросHTTP.ПараметрыЗапроса.Получить("key")));
	
	Если НЕ ЗначениеЗаполнено(КлючЗапроса) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;								
	КонецЕсли;		
	
	// Проверяем ключ
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеширование.Добавить(КлючЗапроса);		
	ХэшКлюча = Base64Строка(Хеширование.ХешСумма);
	ХэшКлючаВБазе = Константы.ХэшКлючаВыгрузкиРезультатовОбученияСУО.Получить();
	
	Если ХэшКлючаВБазе <> ХэшКлюча Тогда
		Ответ = Новый HTTPСервисОтвет(403);
		Возврат Ответ;												
	КонецЕсли;
	
	// Получаем переменные
	//
	
	ИдентификаторПользователяСтрока = ЗапросHTTP.ПараметрыURL.Получить("ИдентификаторПользователя");
	Пользователь = Неопределено;
	
	Попытка
		Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПользователяСтрока));
	Исключение		
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Возврат Ответ;
	КонецЕсли;	
	
	// Формируем ответ
	
	ОтветСтруктура = Новый Структура();
	ОтветСтруктура.Вставить("КоличествоНовыхОбучений", Документы.ПрохождениеОбученияСУО.КоличествоНовыхОбучений(Пользователь));
	ОтветСтруктура.Вставить("АдресВебКабинета", Справочники.ПубликацииВебКабинетаСУ.АдресВебКабинета());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ОбщегоНазначенияСУ.ДанныеВJSON(ОтветСтруктура));
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Ответ;	
	
КонецФункции
